Revit 2024 API
AdvancedOpaque.SurfaceAlbedo Property
 The property labeled "Color" from the "AdvancedOpaque" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string SurfaceAlbedo { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceAlbedo As String
	Get
Visual C++
public:
static property String^ SurfaceAlbedo {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace